module.exports = {
  singleHeader: `🗄 اطلاعات سفارش \n\n`,
  singleHelp: `✉️ راهنما :‌ برای تایید یا عدم تایید سفارش روی گزینه‌های زیر کلیک نمایید:`,
  listHelp: `✉️ راهنما :‌ برای انجام عملیات، روی لینک اطلاعات سفارش کلیک نمایید تا اطلاعات برای شما نمایش داده شود`,

  verifiedListHeader: `🗂 لیست سفارشات تایید شده \n\n\n\n`,
  unverifiedListHeader: `🗂 لیست سفارشات تایید نشده \n\n\n\n`,

  transactionListHeader: `🗂 لیست ۱۰ تراکنش آخر حساب \n\n\n\n`,

  singleAdminRequestHeader: `🗄 سفارش جدیدی به ثبت رسید \n\n`,

  singleRequestHeader: `🗂 اطلاعات سفارش شما به شرح ذیل می‌باشد: \n\n`,
  singleRequestNotice: `💡 توجه: امکان کنسل کردن سفارش پس از تایید وجود ندارد \n\n`,

  buyAmountText: `⚖️ لطفا مقدار درخواستی برای خرید خود را به گرم وارد نمایید: \n\n 💡 به عنوان مثال : ۱۰ و یا ۱۲۰۰ به معنای ۱۰ گرم و ۱۲۰۰ گرم می‌باشد.`,
  sellAmountText: `⚖️ لطفا مقدار درخواستی برای فروش خود را به گرم وارد نمایید: \n\n 💡 به عنوان مثال : ۱۰ و یا ۱۲۰۰ به معنای ۱۰ گرم و ۱۲۰۰ گرم می‌باشد.`,
};
