module.exports = {
  greeting: `با سلام \nخوش آمدید. 🌹\nجهت فعالسازی حساب و انجام معاملات لطفا ابتدا قوانین را مطالعه نموده و پس از تایید اطلاعات خود را برای ربات ارسال نمایید:`,
  thanksGiving: `با تشکر آبشده خسروشاهی احمدی`,

  policy: {
    text: `👨‍✈️ شرح قوانین:\n\n1️⃣ معاملات فقط به صورت نقدی و جابجایی فیزیکی میباشد.\n\n2️⃣ در حجم معاملات خود دقت فرمایید (حجم معامله نسبت به مقدار بیعانه شما میباشد).\n\n3️⃣ معاملات در روز بعدی جابجا میشوند ( نسبت به دریافت و پرداخت ابشده و شماره حساب روز قبل اقدام فرمایید).\n\n`,

    accept: `✅ خواندم و می‌پذیرم`,
    reject: `❌ مورد قبول من نمی‌باشد`,

    acceptText: `✅ شما قوانین را پذیرفتید`,
    rejectText: `❌ شما قوانین را قبول نکردید`,
  },

  select: `👇 لطفا گزینه مورد نظر را انتخاب نمایید :`,

  getName: `لطفا نام و نام‌خانوادگی خود را بصورت فارسی وارد نمایید:`,

  getNationalCode: `لطفا کدملی خود را بدون فاصله وارد نمایید:`,

  getNationalNumberError: "لطفا یک کدملی معتبر وارد نمایید",

  getNationalNumberDuplicate: "این کدملی قبلا در سیستم ثبت شده است",

  getNationalNumberError: "⚠️ لطفا از کاراکترهای عددی برای کدملی استفاده نمایید",

  getMobile: `📱 لطفا روی دکمه ارسال شماره همراه کلیک نمایید:\nتایپ شماره موبایل قابل قبول نیست و فقط باید روی دکمه زیر کلیک نمایید:`,

  mobileTextError: "تایپ شماره موبایل قابل قبول نیست و فقط باید روی دکمه زیر کلیک نمایید:",

  mobileAttempt: `📱 ارسال شماره موبایل`,

  pendingActive: `✅ از اعتماد شما سپاسگذاریم، اطلاعات شما نزد ما امانت خواهد بود.\nلطفا منتظر بمانید تا همکاران ما اطلاعات شما را بررسی و نتیجه را خدمت شما اعلام نمایند.\nبعد از تایید اطلاعات شما میتوانید معاملات خود را انجام دهید.\nبا تشکر`,

  users: {
    ignorance: `❌  رد کاربر`,
    acceptance: `✅  تایید کاربر`,
    clientAccess: "✅ حساب کاربری شما فعال شد",
    clientReject: "❌ حساب کاربری شما مسدود شد",
    emptyList: "در حال حاضر کاربری ثبت نام نکرده است.",
  },

  orders: {
    cancel: `❌ لغو عملیات`,
    ignorance: `❌  لغو سفارش`,
    acceptance: `✅  تایید سفارش`,
    disabled: `⚠️ بات در حال حاضر غیرفعال می‌باشد و امکان خرید و فروش وجود ندارد.\n\n📞 برای دریافت اطلاعات بیشتر از قسمت ارتباط با ما، با ما تماس بگیرید`,
    selectError: "⚠️ لطفا فقط روی دکمه تایید یا لغو سفارش کلیک نمایید",
    numberError: "⚠️ لطفا از کاراکترهای عددی برای مقدار درخواستی استفاده نمایید",
    transactionEmptyList: "در حال حاضر تراکنشی برای شما ثبت نشده است.",
    buySuccess: `✅ درخواست خرید شما ثبت شد.\n\n⚠️ لطفا منتظر تایید باشید، این کار ممکن است ۱ دقیقه زمان بر باشد، از صبر شما متشکریم`,
    sellSuccess: `✅ درخواست فروش شما ثبت شد.\n\n⚠️ لطفا منتظر تایید باشید، این کار ممکن است ۱ دقیقه زمان بر باشد، از صبر شما متشکریم`,
    buyPriceError: `⚠️ هیچ قیمتی برای خرید تعیین نشده است. \n\n📞 برای دریافت اطلاعات بیشتر از قسمت ارتباط با ما، با ما تماس بگیرید`,
    sellPriceError: `⚠️ هیچ قیمتی برای فروش تعیین نشده است. \n\n📞 برای دریافت اطلاعات بیشتر از قسمت ارتباط با ما، با ما تماس بگیرید`,
  },

  menus: {
    buy: `🔵 خرید آبشده`,
    sell: `🔴 فروش آبشده`,
    accounting: `💰 حسابداری`,
    help: `📃 راهنما`,
    contact: `☎️ ارتباط با ما`,
    sendMessage: `📫 ارسال پیام`,
    channel: `🔔 عضویت در کانال قیمت گذاری`,
  },

  accounting: {
    transactions: `🧾 10 تراکنش آخر حساب`,
    balance: `💳 دریافت مانده حساب`,
    cancel: `❌ لغو`,
    inactiveSection: `⚠️ این قسمت در حال حاضر فعال نمی‌باشد، پس از فعال شدن، به اطلاع شما می‌رسانیم.\n\n📞 برای اطلاعات بیشتر با حسابداری تماس حاصل فرمایید`,
  },

  cancelGlobal: `❌ لغو عملیات`,
  backToMenu: `🔙 بازگشت به منو اصلی`,

  sendMessage: `✉️ لطفا پیغام خود را ارسال کنید :`,

  help: `❔ لطفا بعد از ثبت نام از قسمت عضویت در کانال قیمت گذاری، لینک کانال قیمت را دریافت کنید . جهت خرید و فروش وزن درخواستی را به گرم وارد کنید .`,

  contact: `📱 حسابداری : ۰۹۱۴۵۸۷۳۱۰۷\n\n📱 حسابداری : ۰۹۱۴۷۸۷۶۲۴۹\n\n📱 معاملات : ۰۹۱۴۹۱۸۷۸۲۳`,

  channelInfo: `🔑 لینک اختصاصی شما :\nhttps://t.me/KhosroShahi_Ahmadi\n\n⏱ مدت زمان اعتبار: 30 دقیقه`,

  notActiveAccount: `⚠️ در حال حاضر حساب شما فعال نبوده و امکان معامله فعال نمیباشد. \n\n⏳ لطفا منتظر تایید حسابتان بمانید.\n\n📞 همچنین شما میتوانید با اطلاعات تماس با ما، با ما در ارتباط باشید.\n\nبا تشکر`,
};
