module.exports = {
  loginText: `ورود به ادمین`,

  greeting: `با سلام ، \n🌹 خوش آمدید. \nبرای ورود به پنل ادمین لطفا روی دکمه زیر کلیک کنید:`,

  greetingAgain: `با سلام ، \n🌹 خوش آمدید. \nلطفا گزینه مورد نظر را انتخاب نمایید:`,

  getUsername: `لطفا نام کاربری خود را وارد نمایید:`,

  getPassword: `لطفا رمز عبور خود را وارد نمایید:`,

  wrongUser: `نام کاربری وارد شده اشتباه می‌باشد`,

  wrongPassword: `رمز عبور وارد شده اشتباه می‌باشد`,

  successLogin: `با موفقیت وارد پنل ادمین شدید، لطفا گزینه مورد نظر را انتخاب نمایید:`,

  menus: {
    price: `تعیین قیمت`,
    verifiedUsers: `لیست کاربران تایید‌شده`,
    unverifiedUsers: `لیست کاربران تایید‌نشده`,
    rateDifference: "تعیین فرق معامله",
    verifiedOrders: `سفارشات تایید شده`,
    unverifiedOrders: `سفارشات تایید نشده`,
    disableBot: `فعالسازی/غیرفعالسازی بات خریدوفروش`,
  },

  users: {
    ignorance: `❌  رد کاربر`,
    acceptance: `✅  تایید کاربر`,
    clientAccess: "✅ حساب کاربری شما فعال شد",
    clientReject: "❌ حساب کاربری شما مسدود شد",
    emptyList: "در حال حاضر کاربری ثبت نام نکرده است.",
  },

  orders: {
    ignorance: `❌  لغو سفارش`,
    acceptance: `✅  تایید سفارش`,
    emptyList: "در حال حاضر سفارشی برای این قسمت ثبت نشده است.",
    performedOrder: `وضعیت این سفارش قبلا ثبت شده است \n\n ممکن است ادمین دیگری وضعیت این سفارش را تغییر داده باشد.`,
    trFailed: (type) => `❌ سفارش ${type === "buy" ? "خرید" : "فروش"} لغو شد`,
    trSuccess: (type) => `✅ سفارش ${type === "buy" ? "خرید" : "فروش"} با موفقیت تایید شد`,
  },

  price: {
    raise: (price) => `+ ${price}`,
    decrease: (price) => `- ${price}`,
    confirmation: `✅  ثبت قیمت`,
    cancel: `❌  لغو قیمت‌گذاری`,
    intro: "💰 لطفا نرخ خرید از ما را به عدد وارد نمایید:",
    rateMiss: `⚠️ لطفا ابتدا از منو، وارد قسمت تعیین فرق معامله شوید، سپس نرخ فرق معامله را وارد نمایید، بعداز آن در این قسمت برای تعیین نرخ خرید و فروش اقدام فرمایید.`,
    changeInfo: `👇 برای تغییر قیمت از کلید های زیر استفاده نمایید و در صورت تایید قیمت روی دکمه تایید کلیک نمایید:\n\n`,
  },

  rate: {
    intro: "💰 لطفا نرخ فرق معامله را به عدد وارد نمایید:",
    success: `✅  نرخ با موفقیت ثبت شد`,
  },

  disable: {
    active: `✅  بات خرید و فروش فعال شد`,
    deactive: `❌  بات خرید و فروش غیرفعال شد`,
  },

  cancelGlobal: `❌ لغو عملیات`,
  errorNumber: `❌ لطفا هنگام ورود داده از اعداد استفاده نمایید.`,
  select: `👇 لطفا گزینه مورد نظر را انتخاب نمایید :`,
  undefiendCommand: "دستور تعریف نشده است",
};
